<!DOCTYPE HTML>
<html lang="en" class="light" dir="ltr">
    <head>
        <!-- Book generated using mdBook -->
        <meta charset="UTF-8">
        <title>Usage - HoWaiHung</title>


        <!-- Custom HTML head -->
        
        <meta name="description" content="">
        <meta name="viewport" content="width=device-width, initial-scale=1">
        <meta name="theme-color" content="#ffffff">

        <link rel="icon" href="../../favicon.svg">
        <link rel="shortcut icon" href="../../favicon.png">
        <link rel="stylesheet" href="../../css/variables.css">
        <link rel="stylesheet" href="../../css/general.css">
        <link rel="stylesheet" href="../../css/chrome.css">
        <link rel="stylesheet" href="../../css/print.css" media="print">

        <!-- Fonts -->
        <link rel="stylesheet" href="../../FontAwesome/css/font-awesome.css">
        <link rel="stylesheet" href="../../fonts/fonts.css">

        <!-- Highlight.js Stylesheets -->
        <link rel="stylesheet" href="../../highlight.css">
        <link rel="stylesheet" href="../../tomorrow-night.css">
        <link rel="stylesheet" href="../../ayu-highlight.css">

        <!-- Custom theme stylesheets -->

    </head>
    <body class="sidebar-visible no-js">
    <div id="body-container">
        <!-- Provide site root to javascript -->
        <script>
            var path_to_root = "../../";
            var default_theme = window.matchMedia("(prefers-color-scheme: dark)").matches ? "navy" : "light";
        </script>

        <!-- Work around some values being stored in localStorage wrapped in quotes -->
        <script>
            try {
                var theme = localStorage.getItem('mdbook-theme');
                var sidebar = localStorage.getItem('mdbook-sidebar');

                if (theme.startsWith('"') && theme.endsWith('"')) {
                    localStorage.setItem('mdbook-theme', theme.slice(1, theme.length - 1));
                }

                if (sidebar.startsWith('"') && sidebar.endsWith('"')) {
                    localStorage.setItem('mdbook-sidebar', sidebar.slice(1, sidebar.length - 1));
                }
            } catch (e) { }
        </script>

        <!-- Set the theme before any content is loaded, prevents flash -->
        <script>
            var theme;
            try { theme = localStorage.getItem('mdbook-theme'); } catch(e) { }
            if (theme === null || theme === undefined) { theme = default_theme; }
            var html = document.querySelector('html');
            html.classList.remove('light')
            html.classList.add(theme);
            var body = document.querySelector('body');
            body.classList.remove('no-js')
            body.classList.add('js');
        </script>

        <input type="checkbox" id="sidebar-toggle-anchor" class="hidden">

        <!-- Hide / unhide sidebar before it is displayed -->
        <script>
            var body = document.querySelector('body');
            var sidebar = null;
            var sidebar_toggle = document.getElementById("sidebar-toggle-anchor");
            if (document.body.clientWidth >= 1080) {
                try { sidebar = localStorage.getItem('mdbook-sidebar'); } catch(e) { }
                sidebar = sidebar || 'visible';
            } else {
                sidebar = 'hidden';
            }
            sidebar_toggle.checked = sidebar === 'visible';
            body.classList.remove('sidebar-visible');
            body.classList.add("sidebar-" + sidebar);
        </script>

        <nav id="sidebar" class="sidebar" aria-label="Table of contents">
            <div class="sidebar-scrollbox">
                <ol class="chapter"><li class="chapter-item expanded affix "><li class="part-title">WEB</li><li class="chapter-item expanded affix "><li class="part-title">DEVOPS</li><li class="chapter-item expanded affix "><li class="part-title">LINUX</li><li class="chapter-item expanded "><div><strong aria-hidden="true">1.</strong> ArchLinux</div></li><li><ol class="section"><li class="chapter-item expanded "><a href="../../OS/Linux/archlinux/usage.html"><strong aria-hidden="true">1.1.</strong> Usage</a></li></ol></li><li class="chapter-item expanded "><div><strong aria-hidden="true">2.</strong> Debian</div></li><li><ol class="section"><li class="chapter-item expanded "><div><strong aria-hidden="true">2.1.</strong> Usage</div></li></ol></li><li class="chapter-item expanded "><div><strong aria-hidden="true">3.</strong> Ubuntu</div></li><li><ol class="section"><li class="chapter-item expanded "><div><strong aria-hidden="true">3.1.</strong> Usage</div></li></ol></li><li class="chapter-item expanded "><div><strong aria-hidden="true">4.</strong> Fedora</div></li><li><ol class="section"><li class="chapter-item expanded "><div><strong aria-hidden="true">4.1.</strong> Usage</div></li></ol></li><li class="chapter-item expanded "><div><strong aria-hidden="true">5.</strong> Slackware</div></li><li><ol class="section"><li class="chapter-item expanded "><div><strong aria-hidden="true">5.1.</strong> Usage</div></li></ol></li><li class="chapter-item expanded "><div><strong aria-hidden="true">6.</strong> Gentoo</div></li><li class="chapter-item expanded affix "><li class="part-title">WINDOWS</li><li class="chapter-item expanded "><div><strong aria-hidden="true">7.</strong> Scoop</div></li><li><ol class="section"><li class="chapter-item expanded "><a href="../../OS/Windows/scoop.html" class="active"><strong aria-hidden="true">7.1.</strong> Usage</a></li></ol></li><li class="chapter-item expanded "><div><strong aria-hidden="true">8.</strong> WSL</div></li><li><ol class="section"><li class="chapter-item expanded "><a href="../../OS/Windows/wsl.html"><strong aria-hidden="true">8.1.</strong> Usage</a></li></ol></li><li class="chapter-item expanded "><li class="spacer"></li><li class="chapter-item expanded affix "><li class="part-title">OTHER</li><li class="chapter-item expanded "><a href="../../_others/language.html"><strong aria-hidden="true">9.</strong> Language</a></li><li class="chapter-item expanded "><a href="../../Programing/rust/rust_runner.html"><strong aria-hidden="true">10.</strong> Runner</a></li><li class="chapter-item expanded affix "><li class="part-title">TEMP</li><li class="chapter-item expanded "><a href="../../_tmp/temp.html"><strong aria-hidden="true">11.</strong> temp</a></li><li class="chapter-item expanded affix "><li class="part-title">DEMO</li><li class="chapter-item expanded "><a href="../../_demo/chapter_1.html"><strong aria-hidden="true">12.</strong> Chapter 1</a></li><li class="chapter-item expanded "><a href="../../_demo/chapter_2.html"><strong aria-hidden="true">13.</strong> Chapter 2</a></li><li class="chapter-item expanded "><a href="../../_demo/demo_1.html"><strong aria-hidden="true">14.</strong> Demo_1</a></li><li class="chapter-item expanded "><a href="../../_demo/demo_2.html"><strong aria-hidden="true">15.</strong> Demo_2</a></li></ol>
            </div>
            <div id="sidebar-resize-handle" class="sidebar-resize-handle">
                <div class="sidebar-resize-indicator"></div>
            </div>
        </nav>

        <!-- Track and set sidebar scroll position -->
        <script>
            var sidebarScrollbox = document.querySelector('#sidebar .sidebar-scrollbox');
            sidebarScrollbox.addEventListener('click', function(e) {
                if (e.target.tagName === 'A') {
                    sessionStorage.setItem('sidebar-scroll', sidebarScrollbox.scrollTop);
                }
            }, { passive: true });
            var sidebarScrollTop = sessionStorage.getItem('sidebar-scroll');
            sessionStorage.removeItem('sidebar-scroll');
            if (sidebarScrollTop) {
                // preserve sidebar scroll position when navigating via links within sidebar
                sidebarScrollbox.scrollTop = sidebarScrollTop;
            } else {
                // scroll sidebar to current active section when navigating via "next/previous chapter" buttons
                var activeSection = document.querySelector('#sidebar .active');
                if (activeSection) {
                    activeSection.scrollIntoView({ block: 'center' });
                }
            }
        </script>

        <div id="page-wrapper" class="page-wrapper">

            <div class="page">
                                <div id="menu-bar-hover-placeholder"></div>
                <div id="menu-bar" class="menu-bar sticky">
                    <div class="left-buttons">
                        <label id="sidebar-toggle" class="icon-button" for="sidebar-toggle-anchor" title="Toggle Table of Contents" aria-label="Toggle Table of Contents" aria-controls="sidebar">
                            <i class="fa fa-bars"></i>
                        </label>
                        <button id="theme-toggle" class="icon-button" type="button" title="Change theme" aria-label="Change theme" aria-haspopup="true" aria-expanded="false" aria-controls="theme-list">
                            <i class="fa fa-paint-brush"></i>
                        </button>
                        <ul id="theme-list" class="theme-popup" aria-label="Themes" role="menu">
                            <li role="none"><button role="menuitem" class="theme" id="light">Light</button></li>
                            <li role="none"><button role="menuitem" class="theme" id="rust">Rust</button></li>
                            <li role="none"><button role="menuitem" class="theme" id="coal">Coal</button></li>
                            <li role="none"><button role="menuitem" class="theme" id="navy">Navy</button></li>
                            <li role="none"><button role="menuitem" class="theme" id="ayu">Ayu</button></li>
                        </ul>
                    </div>

                    <h1 class="menu-title">HoWaiHung</h1>

                    <div class="right-buttons">
                        <a href="../../print.html" title="Print this book" aria-label="Print this book">
                            <i id="print-button" class="fa fa-print"></i>
                        </a>

                    </div>
                </div>


                <!-- Apply ARIA attributes after the sidebar and the sidebar toggle button are added to the DOM -->
                <script>
                    document.getElementById('sidebar-toggle').setAttribute('aria-expanded', sidebar === 'visible');
                    document.getElementById('sidebar').setAttribute('aria-hidden', sidebar !== 'visible');
                    Array.from(document.querySelectorAll('#sidebar a')).forEach(function(link) {
                        link.setAttribute('tabIndex', sidebar === 'visible' ? 0 : -1);
                    });
                </script>

                <div id="content" class="content">
                    <main>
                        <pre><code># SET ENV FOR USER With SCOOP
$env:SCOOP='D:\Scoop'
[environment]::setEnvironmentVariable('SCOOP',$env:SCOOP,'User')
$env:SCOOP_GLOBAL='D:\GlobalScoopApps'
[environment]::setEnvironmentVariable('SCOOP_GLOBAL',$env:SCOOP_GLOBAL,'Machine')
Set-ExecutionPolicy -ExecutionPolicy RemoteSigned -Scope CurrentUser

# Scoop Install 
iex (new-object net.webclient).downloadstring('https://get.scoop.sh')
# iwr -useb get.scoop.sh | iex

# Scoop Proxy
# scoop config proxy 127.0.0.1:7890

# ADD bucket
scoop bucket add extras
scoop bucket add versions
scoop bucket add java
scoop bucket add nonportable
scoop bucket add nirsoft
scoop bucket add nerd-fonts
scoop bucket add dorado https://github.com/h404bi/dorado

# Global App
scoop install sudo -g
scoop install aria2 -g
scoop install 7zip -g
scoop install git -g
scoop install openssh -g

# Generate script For install app 
# (.*?) .*  --&gt;  $1
fluent-terminal-np
windows-terminal
# gow //outdated
# busybox //outdated
cmder
# 
# anaconda3
clash-for-windows
# dark
draw.io
fiddler
innounp
clink
lua
go
# graalvm
# graalvm-jdk11
# graalvm-jdk17
# jmeter
jq
maven
# mingw
# msys
# Cygwin
# msys2
nginx
nodejs
obsidian
openjdk
openjdk11
openjdk17
openjdk21
# openjdk25
oraclejdk
oraclejre8
oraclejdk-lts
pandoc
# perl
postman
potplayer
python
python27
# resilio-sync-np
# ruby
rust
# utools
vscode
wireshark
# xmind
xmind8
zotero
# oh-my-posh
# posh-git

#
another-redis-desktop-manager
baidudisk
bind
busybox
Captura
chromedriver
chromium
DBeaver
dingtalk
exiftool
ffmpeg
firefox
gcc
geckodriver
googlechrome
gzip
idea
LICEcap
make
mqttx
netch
neteasemusic
notepadplusplus
openssl
# openvpn // -g
# sharex
# snipaste
# sublime-text
tabby
# tar
vargrant
# 
vcredist2022
virtualbox-np
virtualbox-with-extension-pack-np
# 
vlc
vncviewer
we-meet
wechat
wget
WinDirStat
winscp
wps // wpsoffice
xz
yarn
#

</code></pre>
<pre><code>scoop install jetbrains-toolbox

# tips：By default all your tools are installed into 'D:\scoop\apps\jetbrains-toolbox\current\apps' folder and are persisted.This could be changed inside settings menu.
  
scoop install vscode

# Add Visual Studio Code as a context menu option by running: 'D:\scoop\apps\vscode\current\install-context.reg'

# For file associations, run 'D:\scoop\apps\vscode\current\install-associations.reg'

scoop install gow vim Baidupcs-go aliyunpan hostcmd sourcetree

scoop install googlechrome telegram wechat draw.io aliyundrive BaiduNetdisk

scoop install YoudaoDict wps
</code></pre>

                    </main>

                    <nav class="nav-wrapper" aria-label="Page navigation">
                        <!-- Mobile navigation buttons -->
                            <a rel="prev" href="../../OS/Linux/archlinux/usage.html" class="mobile-nav-chapters previous" title="Previous chapter" aria-label="Previous chapter" aria-keyshortcuts="Left">
                                <i class="fa fa-angle-left"></i>
                            </a>

                            <a rel="next prefetch" href="../../OS/Windows/wsl.html" class="mobile-nav-chapters next" title="Next chapter" aria-label="Next chapter" aria-keyshortcuts="Right">
                                <i class="fa fa-angle-right"></i>
                            </a>

                        <div style="clear: both"></div>
                    </nav>
                </div>
            </div>

            <nav class="nav-wide-wrapper" aria-label="Page navigation">
                    <a rel="prev" href="../../OS/Linux/archlinux/usage.html" class="nav-chapters previous" title="Previous chapter" aria-label="Previous chapter" aria-keyshortcuts="Left">
                        <i class="fa fa-angle-left"></i>
                    </a>

                    <a rel="next prefetch" href="../../OS/Windows/wsl.html" class="nav-chapters next" title="Next chapter" aria-label="Next chapter" aria-keyshortcuts="Right">
                        <i class="fa fa-angle-right"></i>
                    </a>
            </nav>

        </div>




        <script>
            window.playground_copyable = true;
        </script>

        <script src="../../ace.js"></script>
        <script src="../../editor.js"></script>
        <script src="../../mode-rust.js"></script>
        <script src="../../theme-dawn.js"></script>
        <script src="../../theme-tomorrow_night.js"></script>


        <script src="../../clipboard.min.js"></script>
        <script src="../../highlight.js"></script>
        <script src="../../book.js"></script>

        <!-- Custom JS scripts -->
        <script src="../../mermaid.min.js"></script>
        <script src="../../mermaid-init.js"></script>


    </div>
    </body>
</html>
